tap "go-musicfox/go-musicfox", "https://github.com/go-musicfox/homebrew-go-musicfox.git", trusted: true
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# LLM inference in C/C++
brew "llama.cpp"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Language Server Protocol for Markdown
brew "marksman"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Deep clean and optimize your Mac
brew "mole"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Utility that provides fast incremental file transfer
brew "rsync"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux", args: ["HEAD"]
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Language for application scale JavaScript development
brew "typescript"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# go-musicfox是musicfox的重写版，使用Go编写的网易云音乐命令行程序。
brew "go-musicfox/go-musicfox/go-musicfox", trusted: true
# Application uninstaller
cask "appcleaner"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Replacement for Docker Desktop
cask "orbstack"
# Snip or pin screenshots
cask "snipaste"
# Native database client for many database types
cask "tablepro"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/cmd/gorename"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "olexsmir.xyz/json2go/cmd/json2go"
go "go.uber.org/mock/mockgen"
go "honnef.co/go/tools/cmd/staticcheck"
npm "neovim"
npm "tree-sitter-cli"
